Repository: aalamaki/lw
Catalog: sites/all/modules/cck/translations/content.*.po
Languages: fi

source: The content module, a required component of the Content Construction Kit (CCK), allows administrators to associate custom fields with content types. In Drupal, content types are used to define the characteristics of a post, including the title and description of the fields displayed on its add and edit pages. Using the content module (and the other helper modules included in CCK), custom fields beyond the default "Title" and "Body" may be added. CCK features are accessible through tabs on the <a href="@content-types">content types administration page</a>. (See the <a href="@node-help">node module help page</a> for more information about content types.)
fi: Sisältömoduuli joka on pakollinen osa CCK:ta sallii ylläpitäjien liittää kustomoituja kenttiä sisltötyyppeihin. Drupalissa sisältötyyppejä käytetään määrittelemään postin yksityiskohtia kuten otsikko, kuvaus ja näytettävien kenttien kuvaukset sisällön muokkaus ja lisäyssivuilla. Sisältömoduulin (ja muiden CCK:hon sisältyvien apumoduulien) käyttö sallii kustomoitujen kenttien lisäämisen otsikon ja rungon alle. CCK:n ominaisuudet läytyvät tabien alta <a href="@content-types">sisältötyyppien hallintasivulta</a>. (Lisätietoa sisältötyypeistä löytyy <a href="@node-help">solmu-moduulin tukisivulta</a>.)

source: When adding acustom field to a content type, you determine its type (whether it will contain text, numbers, or references to other objects) and how it will be displayed (either as a text field or area, a select box, checkbox, radio button, or autocompleting field). A field may have multiple values (i.e., a "person" may have multiple e-mail addresses) or a single value (i.e., an "employee" has a single employee identification number). As you add and edit fields, CCK automatically adjusts the structure of the database as necessary. CCK also provides a number of other features, including intelligent caching for your custom data, an import and export facility for content type definitions, and integration with other contributed modules.
fi: Kun lisäät kustomoidun kentän sisältötyyppiin, voit määritellä sen tyypin (sisältääkö se tekstiä, numeroita tai viittauksia muihin objekteihin) ja kuinka ne näytetään (tekstikenttänä, tekstialueena, valintalaatikkona, valintalistana, radionappina tai automaattisesti täyttyvänä kenttänä). Kentällä voi olla useita arvoja (esim. henkilöllä voi olla useita sähköpostiosoitteita) tai ainoastaan yksi arvo (esim. työntekijän tunnistenumero). Kun muokkaat tai lisäät kenttiä, CCK päivittää automaattisesti tietokannan rakennetta tarvittavin osin. CCK myös tarjoaa koko joukon muita ominaisuuksia mukaanlukien oman kustomoidun tietosi älykkään välimuistituksen sekä sisältötyyppien vienti ja tuontitoiminnot sekä integraation muihin tarjollaoleviin moduuleihin.

source: Custom field types are provided by a set of optional modules included with CCK (each module provides a different type). The <a href="@modules">modules page</a> allows you to enable or disable CCK components. A default installation of CCK includes:
fi: Kustomoidut kenttätyypit löytyvät CCK:n mukana tulevien valinnaisten moduulien joukosta (jokainen moduuli tarjoaa eri tyypin). <a href="@modules">Moduulisivulla</a> voit aktivoida tai poistaa käytöstä CCK:n komponentteja. CCK:n perusasennus sisältää seuraavaa:

source: <em>number</em>, which adds numeric field types, in integer, decimal or floating point form. You may define a set of allowed inputs, or specify an allowable range of values. A variety of common formats for displaying numeric data are available.
fi: <em>numero</em>, joka lisää numeeriset kenttätyypit joko muuttuja, desimaali tai kelluvan luvun muodossa. Voit myös määrittää joukon sallittuja syöteitä tai määrittää miltä väliltä sallittujen arvojen on oltava. Tarjolla on koko joukko yleisimpiä tapoja esittää numeerista dataa.

source: <em>text</em>, which adds text field types. A text field may contain plain text only, or optionally, may use Drupal's input format filters to securely manage rich text input. Text input fields may be either a single line (text field), multiple lines (text area), or for greater input control, a select box, checkbox, or radio buttons. If desired, CCK can validate the input to a set of allowed values.
fi: <em>teksti</em>, joka lisää tekstityypit. Tekstityypit sisältävät ainoastaa puhdasta tekstiä tai vaihtoehtoisesti voit määrittää Drupalin syöttötyyppisuodattimien avulla rikasta sisältöä. Tekstikentät voivat olla joko yhden (tekstikenttä) tai usean rivin mittaisia (tekstialue) tai jos haluat antaa suurempaa hallittavuutta, myös radio napit, valintaruutu tai valintalista. Jos haluat, CCK voi validoida syötetyn datan joukkoon sallittuja arvoja.

source: <em>nodereference</em>, which creates custom references between Drupal nodes. By adding a <em>nodereference</em> field and two different content types, for instance, you can easily create complex parent/child relationships between data (multiple "employee" nodes may contain a <em>nodereference</em> field linking to an "employer" node).
fi: <em>solmureferenssi</em>, joka luo kustomoidun referenssin muihin Drupalin solmuihin. Lisäämällä <em>solmureferenssi</em> kentän ja kaksi eri sisältötyyppiä, esimerkiksi, voit tarjota kompleksimpia isäntä/lapsi suhteita datan välillä (useilla "työntekijä" solmuilla voi olla <em>solmureferenssi</em> joka linkittää ne "työntekijä" solmuun).

source: <em>userreference</em>, which creates custom references to your sites' user accounts. By adding a <em>userreference</em> field, you can create complex relationships between your site's users and posts. To track user involvement in a post beyond Drupal's standard <em>Authored by</em> field, for instance, add a <em>userreference</em> field named "Edited by" to a content type to store a link to an editor's user account page.
fi: <em>käyttäjäreferenssi</em>, joka luo kustomisoidun referenssin sivustosi käytäjätileihin. Lisäämällä <em>userreference</em> kentän voit luoda komplekseja suhteita sivustosi eri käyttäjien ja postien välille. Jäljittääksesi postia esimerkiksi Drupalin standardissa <em>Tekijänimi</em> kentässä, lisäät vain <em>userreference</em> nimllä "Editoinut" sisältötyyppiin. Näin muodostuu linkki solmua muokanneen käyttäjän profiiliin.

source: <em>fieldgroup</em>, which creates collapsible fieldsets to hold a group of related fields. A fieldset may either be open or closed by default. The order of your fieldsets, and the order of fields within a fieldset, is managed via a drag-and-drop interface provided by content module.
fi: <em>kenttäryhmä</em>, joka luo piennettävän kenttäryhmän auttamaan kenttien ryhmittelyssä. Kenttäryhmä voi oletuksena olla joko avoin tai suljettu. Kenttäryhmien järjestys, ja kenttien järjestys kenttäryhmän sisällä on määritettävissä sisältömoduulin tarjoaman vedä-pudota käyttöliittymän avulla.

source: For more information, see the online handbook entry for <a href="@handbook-cck">CCK</a> or the <a href="@project-cck">CCK project page</a>.
fi: Lisätietoa saat <a href="@handbook-cck">CCK online-käsikirjasta</a> tai <a href="@project-cck">CCK projektin sivuilta</a>.

source: This field is required.
fi: Pakollinen kenttä

source: Basic
fi: Perus

source: Search
fi: Hae

source: Search Index
fi: Hakuindeksi

source: Search Result
fi: Hakutulokset

source: Print
fi: Tulosta

source: Node module form.
fi: Solmumoduulin syöttökaavake.

source: Language
fi: Kieli

source: Locale module form.
fi: Paikkamoduulin syöttökaavake.

source: Menu settings
fi: Valikkoasetukset

source: Menu module form.
fi: Valikkomoduulin syöttökaavake.

source: Taxonomy
fi: Taksonomia

source: Taxonomy module form.
fi: Taksonomiamoduulin syöttökaavake.

source: Book
fi: Kirja

source: Book module form.
fi: Kirjamoduulin syöttökaavake.

source: Poll title
fi: Äänestyksen otsikko

source: Poll module title.
fi: Äänestysmoduulin otsikko.

source: Poll choices
fi: Äänestyksen vaihtoehdot

source: Poll module choices.
fi: Äänestysmoduulin vaihtoehdot.

source: Poll settings
fi: Äänestysasetukset

source: Poll module settings.
fi: Äänestysmoduulin asetukset

source: File attachments
fi: Liitetiedostot

source: Upload module form.
fi: Moduulin latauskaavake.

source: Updating field type %type with module %module.
fi: Päivitetään kentän tyyppiä %type moduulilla %module.

source: Updating widget type %type with module %module.
fi: Päivitetään widgettiä tyyppiä %type moduulilla %module.

source: Use PHP input for field settings (dangerous - grant with care)
fi: Käytä PHP:tä kentän asetuksissa (vaarallista - salli varoen)

source: Fields
fi: Kentät

source: Manage fields
fi: Hallitse kenttiä

source: Display fields
fi: Näytä kentät

source: Remove field
fi: Poista kenttä

source: Updates for CCK-related modules are not run until the modules are enabled on the <a href="@admin-modules-path">administer modules page</a>. When you enable them, you'll need to return to <a href="@update-php">update.php</a> and run the remaining updates.
fi: Päivityksiä CCK:hon liittyviin moduuleihin ei ajeta ennenkuin moduulit ovat aktivoituina <a href="@admin-modules-path">moduulien ylläpitosivulla. Jos aktivoit ne, sinun pitää ajaa uudelleen <a href="@update-php">update.php</a> suorittaaksesi loput päivitykset.</a>

source: !module.module has updates but cannot be updated because content.module is not enabled.<br />If and when content.module is enabled, you will need to re-run the update script. You will continue to see this message until the module is enabled and updates are run.
fi: !module.module on päivitettävissä mutta päivitystä ei voida ajaa koska content.module ei ole aktivoituna.<br />Jos ja kun moduuli on aktivoituna, sinun on ajettava uudelleen päivityskoodi. Näet tämän viestin niin kauan kuin moduuli ei ole aktivoituna ja päivitettynä.

source: !module.module has updates and is available in the modules folder but is not enabled.<br />If and when it is enabled, you will need to re-run the update script. You will continue to see this message until the module is enabled and updates are run.
fi: !module.module on päivitettävissä moduulikansiossa mutta moduuli ei ole aktivoituna.<br />Jos ja kun moduuli on aktivoituna, sinun on ajettava uudelleen päivityskoodi. Näet tämän viestin niin kauan kuin moduuli ei ole aktivoituna ja päivitettynä.

source: Some updates are still pending. Please return to <a href="@update-php">update.php</a> and run the remaining updates.
fi: Jotkut päivityksistä ovat edelleen asentamatta. Palaa sivulle <a href="@update-php"> ja suorita puuttuvat päivitykset.

source: Some updates are still pending.<br/>Please re-run the update script.
fi: Jotkut päivityksistä ovat edelleen asentamatta.<br>Aja uudelleen päivityskoodi.

source: CCK - No Views integration
fi: Ei Näkymintegraatiota tarjolla

source: CCK integration with Views module requires Views 6.x-2.0-rc2 or greater.
fi: CCK kenttien integraatio Views moduuliin vaatii vähintään version Views 6.x-2.0-rc2.

source: Content
fi: Sisältö

source: Allows administrators to define new content types.
fi: Sallii ylläpitäjien määrittää uusia sisältötyyppejä.
