Repository: aalamaki/lw
Catalog: sites/all/modules/cck/translations/includes-views-handlers.*.po
Languages: fi

source: None
fi: Ei mitٶٶn

source: Widget label (@label)
fi: Widgetin otsikko (@label)

source: Custom
fi: Kustomoitu

source: Custom label
fi: Kustomoitu otsikko

source: Format
fi: Formaatti

source: Group multiple values
fi: Ryhmitٶ useat arvot

source: If unchecked, each item in the field will create a new row, which may appear to cause duplicates. This setting is not compatible with click-sorting in table displays.
fi: Jos valitsematta, jokainen arvo kentٶssٶ nٶytetٶٶn omalla rivillٶٶn mistٶ voi seurata kaksoiskappaleita. Tٶmٶ asetus ei ole yhteensopiva klikkaus-jٶrjestelyn kanssa tauluissa.

source: Show @count value(s)
fi: Nٶytٶ @count arvo(t)

source: starting from @count
fi: aloitetaan kohdasta @count

source: Reversed (start from last values)
fi: Kٶٶnteinen (aloita viimeisestٶ arvosta)

source: All
fi: Kaikki

source: The delta allows you to select which item in a multiple value field to key the relationship off of. Select "1" to use the first item, "2" for the second item, and so on. If you select "All", each item in the field will create a new row, which may appear to cause duplicates.
fi: Delta sallii sinun valita mitٶ arvoa moniarvoisen kentٶn arvoista kٶytetٶٶn. Valitse "1" kٶyttٶٶksesi ensimmٶistٶ arvoa, "2" seuraavaa jne. Jos valitset "Kaikki", jokainen arvo nٶytetٶٶn omalla rivillٶٶn mikٶ voi johtaa kaksoiskappaleisiin.

source: The delta allows you to select which item in a multiple value field will be used for sorting. Select "1" to use the first item, "2" for the second item, and so on. If you select "All", each item in the field will create a new row, which may appear to cause duplicates.
fi: Delta sallii sinun valita mitٶ arvoa moniarvoisen kentٶn arvoista kٶytetٶٶn jٶrjestyksen mٶٶrittelemiseen. Valitse "1" kٶyttٶٶksesi ensimmٶistٶ arvoa, "2" seuraavaa jne. Jos valitset "Kaikki", jokainen arvo nٶytetٶٶn omalla rivillٶٶn mikٶ voi johtaa kaksoiskappaleisiin.
